'''
Завдання 3
Створіть програму-калькулятор, яка підтримує наступні операції:
додавання, віднімання, множення, ділення,
зведення в ступінь, зведення до квадратного та кубічного коренів.
Всі дані повинні вводитися в циклі, доки користувач не вкаже,
що хоче завершити виконання програми.
Кожна операція має бути реалізована у вигляді окремої функції.
Функція ділення повинна перевіряти дані на коректність
та видавати повідомлення про помилку у разі спроби поділу на нуль.
'''
try:
    print(5/0)
except ZeroDivisionError:
    print("error!!!")
finally:
    print("finally!")
